bcv_parser::regexps.space = "[\\s\\xa0]"
bcv_parser::regexps.escaped_passage = ///
	(?:^ | [^\x1f\x1e\dA-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ] )	# Beginning of string or not in the middle of a word or immediately following another book. Only count a book if it's part of a sequence: `Matt5John3` is OK, but not `1Matt5John3`
		(
			# Start inverted book/chapter (cb)
			(?:
				  (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s* (?: [\u2013\u2014\-] | through | thru | to) \s* \d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: \d+ (?: th | nd | st ) \s*
					ch (?: apter | a?pt\.? | a?p?\.? )? \s* #no plurals here since it's a single chapter
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )? \s* )
			)? # End inverted book/chapter (cb)
			\x1f(\d+)(?:/\d+)?\x1f		#book
				(?:
				    /\d+\x1f				#special Psalm chapters
				  | [\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014]
				  | title (?! [a-z] )		#could be followed by a number
				  | розділ | глави | глава | вірші | розд | вірш | гл | ff | - | і
				  | [aаб] (?! \w )			#a-e allows 1:1a
				  | $						#or the end of the string
				 )+
		)
	///gi
# These are the only valid ways to end a potential passage match. The closing parenthesis allows for fully capturing parentheses surrounding translations (ESV**)**. The last one, `[\d\x1f]` needs not to be +; otherwise `Gen5ff` becomes `\x1f0\x1f5ff`, and `adjust_regexp_end` matches the `\x1f5` and incorrectly dangles the ff.
bcv_parser::regexps.match_end_split = ///
	  \d \W* title
	| \d \W* ff (?: [\s\xa0*]* \.)?
	| \d [\s\xa0*]* [aаб] (?! \w )
	| \x1e (?: [\s\xa0*]* [)\]\uff09] )? #ff09 is a full-width closing parenthesis
	| [\d\x1f]
	///gi
bcv_parser::regexps.control = /[\x1e\x1f]/g
bcv_parser::regexps.pre_book = "[^A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ]"

bcv_parser::regexps.first = "(?:Перша|Перше|1-ше|1-[ае]|1|I)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.second = "(?:Друга|Друге|2-ге|2-[ае]|2|II)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.third = "(?:Третя|Третє|3-тє|3-[ае]|3|III)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.range_and = "(?:[&\u2013\u2014-]|і|-)"
bcv_parser::regexps.range_only = "(?:[\u2013\u2014-]|-)"
# Each book regexp should return two parenthesized objects: an optional preliminary character and the book itself.
bcv_parser::regexps.get_books = (include_apocrypha, case_sensitive) ->
	books = [
		osis: ["Ps"]
		apocrypha: true
		extra: "2"
		regexp: ///(\b)( # Don't match a preceding \d like usual because we only want to match a valid OSIS, which will never have a preceding digit.
			Ps151
			# Always follwed by ".1"; the regular Psalms parser can handle `Ps151` on its own.
			)(?=\.1)///g # Case-sensitive because we only want to match a valid OSIS.
	,
		osis: ["Gen"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|1(?:\-?(?:ше(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])|[ае](?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий]))сеева|\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|[\s\xa0]*(?:книга[\s\xa0]*Мо[ий]сеева|М))|I(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])сеева|Buttja|Бу(?:ття|г)|Бут|Gen)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Exod"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|2(?:\-?(?:ге(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])|[ае](?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий]))сеева|\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|[\s\xa0]*(?:книга[\s\xa0]*Мо[ий]сеева|М))|II(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])сеева|Вихід|Vy[hȟ]id|Exod|Вих)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bel"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Бел(?:[\s\xa0]*і[\s\xa0]*дракон)?|Bel)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lev"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Трет[яє][\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|3(?:\-?(?:тє(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])|[ае](?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий]))сеева|\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|[\s\xa0]*(?:книга[\s\xa0]*Мо[ий]сеева|М))|III(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])сеева|Левит|Levyt|Lev)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Num"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Ч(?:етверта[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|ис(?:ла)?)|(?:IV|4)\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|IV[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|4[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|[CČ]ysla|Num|4[\s\xa0]*М)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sir"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Премудрість[\s\xa0]*Ісуса,[\s\xa0]*сина[\s\xa0]*Сирахова|(?:Книга[\s\xa0]*|Бен[\s\xa0]*)?Сираха|Еклесіаст|Сир|Sir)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Wis"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:Премудрості[\s\xa0]*Соломона|Мудрости)|Премудрість[\s\xa0]*Соломона|Мудрости|Прем|Муд|Wis)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lam"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Pla[cč][\s\xa0]*Jeremi[i\xEF]|Плач[\s\xa0]*Єремі[ії]|Плач|Lam)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["EpJer"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послання[\s\xa0]*Єремі[ії]|Лист[\s\xa0]*Єремі[ії]|EpJer)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rev"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:О(?:б['’]явлення[\s\xa0]*(?:св(?:\.[\s\xa0]*(?:[ИЙ]о|Ів)|[\s\xa0]*(?:[ИЙ]о|Ів))|Ів)ана[\s\xa0]*Богослова|дкр(?:овення[\s\xa0]*Івана[\s\xa0]*Богослова|иттє))|Ob['’]javlennja[\s\xa0]*Ivana[\s\xa0]*Bohoslova|Відкриття[\s\xa0]*Івана|Апок(?:а(?:́лі|л[i\xEDі])|[a\xE1]лі)псис|Rev)|(?:Об(?:['’]явлення)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrMan"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:PrMan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Deut"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:П(?:['’]ята[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|овт(?:(?:орення|\.)?[\s\xa0]*Закону)?)|Povtorennja[\s\xa0]*Zakonu|Второзаконня|Втор|Deut|5[\s\xa0]*М)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Josh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:Ісуса[\s\xa0]*Навина|Єгошу[ії])|Ісуса[\s\xa0]*Навина|Isus[\s\xa0]*Navyn|І(?:сус[\s\xa0]*Навин|\.?[\s\xa0]*Нав)|Єгошу[ії]|Josh|Нав|Єг)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Judg"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Суддів|Knyha[\s\xa0]*Suddiv|Суддів|Judg|Суд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ruth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Рут|Ruth?|Рут)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*Ездр[аи]|1(?:\-?(?:ше(?:\.[\s\xa0]*Ездр[аи]|[\s\xa0]*Ездр[аи])|[ае](?:\.[\s\xa0]*Ездр[аи]|[\s\xa0]*Ездр[аи]))|\.[\s\xa0]*Ездр[аи]|[\s\xa0]*Ездр[аи]|[\s\xa0]*Езд|Esd)|I(?:\.[\s\xa0]*Ездр[аи]|[\s\xa0]*Ездр[аи]))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи]))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])))|\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|[\s\xa0]*книга[\s\xa0]*Ездри|[\s\xa0]*Ездр[аи]|[\s\xa0]*Езд|Esd)|II(?:\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Isa"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:пророка[\s\xa0]*Іса[ії]|Іса[ий][ії])|Isaja|Іса[яії]|Isa|Іс)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)))|\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*книга[\s\xa0]*Саму[ії]лова|[\s\xa0]*Саму[ії]лова|[\s\xa0]*Сам(?:у[ії]л)?|[\s\xa0]*Samu[i\xEF]l|Sam)|II(?:\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)))|\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*книга[\s\xa0]*Саму[ії]лова|[\s\xa0]*Саму[ії]лова|[\s\xa0]*Сам(?:у[ії]л)?|[\s\xa0]*Samu[i\xEF]l|Sam)|I(?:\.[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)|[\s\xa0]*(?:книга[\s\xa0]*Саму[ії]лова|Саму[ії]лова|Саму[ії]л|Samu[i\xEF]l)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)))|\.[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|[\s\xa0]*книга[\s\xa0]*царів|[\s\xa0]*Cariv|[\s\xa0]*царів|[\s\xa0]*Цар|Kgs)|II(?:\.[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів))|(?:Четверта|IV\.?|4\.?)[\s\xa0]*Царів)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:Перш[ае]|I\.)[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)))|\.[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|[\s\xa0]*книга[\s\xa0]*царів|[\s\xa0]*Cariv|[\s\xa0]*царів|[\s\xa0]*Цар|Kgs)|I[\s\xa0]*(?:книга[\s\xa0]*царів|Cariv|царів)|(?:Трет[яє]|3\-?(?:тє|[ае])\.?|III\.?|3\.|3)[\s\xa0]*Царів)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)))|\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*книга[\s\xa0]*хроніки?|[\s\xa0]*Літопису|[\s\xa0]*хроніки|[\s\xa0]*Хроніка|[\s\xa0]*[HȞ]roniky|[\s\xa0]*Хр(?:онік)?|Chr)|II(?:\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)))|\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*книга[\s\xa0]*хроніки?|[\s\xa0]*Літопису|[\s\xa0]*хроніки|[\s\xa0]*Хроніка|[\s\xa0]*[HȞ]roniky|[\s\xa0]*Хр(?:онік)?|Chr)|I(?:\.[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)|[\s\xa0]*(?:книга[\s\xa0]*хроніки?|Літопису|хроніки|Хроніка|[HȞ]roniky|Хронік)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezra"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Ездри|Ездр[аи]|Ezd?ra|Єздри|[ЄЕ]зд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Neh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Неемі[ії]|Ne(?:emija|h)|Неемі[яії]|Неємі[ії]|Не[еє]м)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["GkEsth"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:GkEsth)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Esth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Ес(?:фі|те)р|Est(?:er|h)|Ес(?:те|фі)р|Ест)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Job"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*[ІИЙ]ова|[ИЙ]ова|Іова|[ИЙ]ов|Jo[bv])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ps"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Псалмів|Псал(?:ти́р|ом|ми)|Псалмів|Psalmy|Ps|Пс)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrAzar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Молитва[\s\xa0]*Азарі[ії]|PrAzar)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Prov"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*При(?:повісте[ий]|казок)[\s\xa0]*Соломонових|Приповісте[ий][\s\xa0]*соломонових|При(?:тчі[\s\xa0]*Соломона|пові(?:док|сті)|казки|казок)|Пр(?:и(?:повісте[ий]|тчі?))?|Pr(?:ypovisti|ov))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eccl"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:К(?:нига[\s\xa0]*Екк?лезіястова|оге́лет)|Екклезіястова|(?:Проповідник|Екклезіаст)а|Еклезіястова|E(?:kklezijast|ccl)|Екклезіяста|Ек(?:кл(?:езіяст)?|л))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["SgThree"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Пісня[\s\xa0]*трьох[\s\xa0]*отроків|SgThree)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Song"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Пісн(?:і[\s\xa0]*Пісень|я[\s\xa0]*Пісне[ий]))|(?:Книга[\s\xa0]*Пісні[\s\xa0]*Пісень[\s\xa0]*Соломона|Пісня[\s\xa0]*над[\s\xa0]*піснями[\s\xa0]*Соломона|Pisnja[\s\xa0]*nad[\s\xa0]*pisnjamy|Пісн(?:я[\s\xa0]*над[\s\xa0]*піснями)?|Song|П\.?[\s\xa0]*П)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jer"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Єремі[ії]|Jeremija|Єремі[яії]|Jer|Єр)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezek"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Єзекі[ії]ля|Jezeki[i\xEF]l['’]|Єзекі[ії]л[аья]|Ezek|Єз)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Dan"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Дани[ії]ла|Дани[ії]ла|Дан(?:и[ії]л)?|Dany[i\xEF]l|Dan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Осі[ії]|Osija|Осі[яії]|Hos|Ос)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Joel"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:пророка[\s\xa0]*[ИЙ]|[ИЙ])оіла|[ИЙ]о(?:і(?:ла|н)|ї[лн])|[ИЙ]оіл|Jo[ei\xEF]l)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Amos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Амоса|Амоса|Ам(?:ос)?|Amos)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Obad"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*[АО]вдія|Овді[ийя]|O(?:vdij|bad)|Авдія|Овд?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jonah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*[ИЙ]они|Jonah|Jona|[ИЙ]он[аи])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mic"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*М[иі]хея|Михе[ийя]|M(?:y[hȟ]ej|ic)|Міхея|М[иі]х)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Nah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Наума|Наума|Наум|Na(?:um|h))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hab"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Авакума|Авакума|Ав(?:акум)?|Avakum|Hab)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zeph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Софоні[ії]|Sofonija|Софоні[яії]|Zeph|Соф)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hag"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:пророка[\s\xa0]*)?Огія|Аггея|Огі[ийя]|Ohij|Hag|Ог)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zech"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:пророка[\s\xa0]*Захарія|Захарі[ії])|Захарі[ийяії]|Z(?:a[hȟ]arij|ech)|Зах)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:пророка[\s\xa0]*Малахі[ії]|Малахі[ії])|Mala[hȟ]ija|Малахі[яії]|Мал|Mal)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Matt"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Євангелі(?:є[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*Матві|Мат(?:ві|е))|я[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Матві)я|Jevanhelije[\s\xa0]*vid[\s\xa0]*Matvija|Від[\s\xa0]*Матвія|Матвія|М(?:ате[ий]|т)|Matt|Мат)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:Друг[ае][\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|II(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Макаве[ії]в|[\s\xa0]*Мак|Macc|[\s\xa0]*Мк))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:Трет[яє][\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|III(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|3(?:\-?(?:тє(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Макаве[ії]в|[\s\xa0]*Мак|Macc|[\s\xa0]*Мк))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["4Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Четверта[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|(?:IV|4)\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|IV[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|4(?:[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Макаве[ії]в|[\s\xa0]*Мак|Macc|[\s\xa0]*Мк))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:Перш[ае][\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|I(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Макаве[ії]в|[\s\xa0]*Мак|Macc|[\s\xa0]*Мк))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mark"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Євангелі[яє][\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Марка|Jevanhelije[\s\xa0]*vid[\s\xa0]*Marka|Від[\s\xa0]*Марка|М(?:арк[ао]|[кр])|Mark)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Luke"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Євангелі(?:є[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*Лу|Лу[\s\xa0]*?)|я[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Лу)ки|Jevanhelije[\s\xa0]*vid[\s\xa0]*Luky|Від[\s\xa0]*Луки|Л(?:ук[аи]|к)|Luke)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна))|[ае](?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)))|\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[\s\xa0]*[ИЙ]оаново|[\s\xa0]*Іоанна|John|[\s\xa0]*Ів)|I(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна))|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Ivana)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна))|[ае](?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)))|\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[\s\xa0]*[ИЙ]оаново|[\s\xa0]*Іоанна|John|[\s\xa0]*Ів)|II(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна))|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Ivana|Послання[\s\xa0]*до[\s\xa0]*Тита)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Трет[яє][\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|3(?:\-?(?:тє(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна))|[ае](?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)))|\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[\s\xa0]*[ИЙ]оаново|[\s\xa0]*Іоанна|John|[\s\xa0]*Ів)|III(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна)|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна))|Tretje[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Ivana)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["John"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Євангелі(?:є[\s\xa0]*від[\s\xa0]*(?:св(?:\.[\s\xa0]*[ИЙ]|[\s\xa0]*[ИЙ])о|Ів)|я[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Ів)ана|J(?:evanhelije[\s\xa0]*vid[\s\xa0]*Ivana|ohn)|Від[\s\xa0]*Івана|[ИЙ]оана|Івана|[ИЙ]оан|Ів|Ін)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Acts"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Dijannja[\s\xa0]*svjaty[hȟ][\s\xa0]*apostoliv|Ді(?:яння[\s\xa0]*Святих[\s\xa0]*А|[ії][\s\xa0]*(?:святих[\s\xa0]*а|А))постолів|Ді(?:ян(?:ня)?|[ії])|Acts)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rom"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*|апостола[\s\xa0]*Павла[\s\xa0]*)?до[\s\xa0]*римлян|Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*rymljan|До[\s\xa0]*римлян|Римляни|Рим(?:лян)?|Rom)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:Друг[ае]|2(?:\-?(?:ге\.?|[ае]\.?)|\.)?|II\.?)[\s\xa0]*Коринтяни)|(?:Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*korynfjan|(?:Друг[ае][\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|II(?:\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)))ян|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф))|[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)))ян|\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)ян|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринфян|[\s\xa0]*(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринтян|[\s\xa0]*Коринфян|Cor)|2[\s\xa0]*Кор)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:Перш[ае]|1(?:\-?(?:ше\.?|[ае]\.?)|\.)?|I\.?)[\s\xa0]*Коринтяни)|(?:Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*korynfjan|(?:Перш[ае][\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|I(?:\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)))ян|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф))|[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)))ян|\.[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф|(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф)ян|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринфян|[\s\xa0]*(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринтян|[\s\xa0]*Коринфян|Cor)|1[\s\xa0]*Кор)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Gal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:По(?:слання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*|апостола[\s\xa0]*Павла[\s\xa0]*)?до[\s\xa0]*г|[\s\xa0]*слання[\s\xa0]*до[\s\xa0]*Г)алатів|Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*halativ|До[\s\xa0]*галатів|Галатяни|Галатів|Гал|Gal)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:По(?:слання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*|апостола[\s\xa0]*Павла[\s\xa0]*)?до[\s\xa0]*е|[\s\xa0]*слан[\s\xa0]*ня[\s\xa0]*до[\s\xa0]*Є)фесян|Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*efesjan|До[\s\xa0]*ефесян|Ефесяни|Еф(?:есян)?|Eph|Єф)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phil"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послання[\s\xa0]*(?:св(?:\.[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*филип['’]|[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*филип['’])|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*филип['’]|до[\s\xa0]*(?:Філіп['’]|филип['’]))ян|P(?:oslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*fylyp['’]jan|hil)|Ф(?:илип['’]?яни|лп)|Фил)|(?:(?:До[\s\xa0]*филип['’]|Филип['’])ян)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Col"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*к|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*к|до[\s\xa0]*К)олосян|Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*kolosjan|До[\s\xa0]*колоссян|Колосяни|Колоссян|Кол(?:осян)?|Col)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян))|[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)))|\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|[\s\xa0]*фессалонікі[ий]ців|[\s\xa0]*до[\s\xa0]*солунян|[\s\xa0]*Солуньці|[\s\xa0]*Солунян|Thess|[\s\xa0]*Сол)|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*solunjan|II(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян))|[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)))|\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|[\s\xa0]*фессалонікі[ий]ців|[\s\xa0]*до[\s\xa0]*солунян|[\s\xa0]*Солуньці|[\s\xa0]*Солунян|Thess|[\s\xa0]*Сол)|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*solunjan|I(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян))|фессалонікі[ий]ців|до[\s\xa0]*солунян|Солуньці|Солунян)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію)))|[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))))|\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|[\s\xa0]*(?:до[\s\xa0]*Ти|Ти\xAD)мофія|[\s\xa0]*Тимоте[ий]|[\s\xa0]*Тимофію|[\s\xa0]*Тим|Tim)|II(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію)))|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Tymofija)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію)))|[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))))|\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|[\s\xa0]*(?:до[\s\xa0]*Ти|Ти\xAD)мофія|[\s\xa0]*Тимоте[ий]|[\s\xa0]*Тимофію|[\s\xa0]*Тим|Tim)|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Tymofija|I(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))|[\s\xa0]*(?:послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|до[\s\xa0]*Тимотея|до[\s\xa0]*Тимофія|Тимофію)|(?:до[\s\xa0]*Ти|Ти\xAD)мофія|Тимо(?:те[ий]|фію))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Titus"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послан(?:ня[\s\xa0]*(?:св\.?[\s\xa0]*)?апостола[\s\xa0]*Павла|[\s\xa0]*ня)[\s\xa0]*до[\s\xa0]*Тита|Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Tyta|До[\s\xa0]*Тита|Titus|Тита|Тит)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phlm"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона|до[\s\xa0]*Фили(?:пі[ий]ців|мона))|P(?:oslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Fylymona|hlm)|До[\s\xa0]*Филимона|Ф(?:илимона|лм)|Филим(?:он)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Heb"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Poslannja[\s\xa0]*do[\s\xa0]*jevre[i\xEF]v|Послан(?:[\s\xa0]*ня[\s\xa0]*до[\s\xa0]*Євре[ії]|ня[\s\xa0]*до[\s\xa0]*євре[ії])в|До[\s\xa0]*євре[ії]в|Євре[ії]в|Євр(?:е[ії])?|Heb)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jas"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*)?Якова|Poslannja[\s\xa0]*apostola[\s\xa0]*Jakova|Послання[\s\xa0]*апостола[\s\xa0]*Якова|Послання[\s\xa0]*Якова|Якова|Як(?:ов)?|Jas)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Друг[ае][\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|2(?:\-?(?:ге(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а)))|[ае](?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))))|\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Петра|[\s\xa0]*послання[\s\xa0]*Петра|[\s\xa0]*Петрово|[\s\xa0]*Петра|[\s\xa0]*Петр?|Pet)|II(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а)))|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Petra)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Перш[ае][\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|1(?:\-?(?:ше(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а)))|[ае](?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))))|\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Петра|[\s\xa0]*послання[\s\xa0]*Петра|[\s\xa0]*Петрово|[\s\xa0]*Петра|[\s\xa0]*Петр?|Pet)|I(?:\.[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а))|[\s\xa0]*(?:соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|послання[\s\xa0]*апостола[\s\xa0]*Петра|послання[\s\xa0]*Петра|Петр(?:ово|а)))|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Petra)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jude"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*)?Юди|Poslannja[\s\xa0]*apostola[\s\xa0]*Judy|Послання[\s\xa0]*апостола[\s\xa0]*Юди|Послання[\s\xa0]*(?:Іу|Ю)ди|Jude|Юд[аи]|Іуд|Юд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Tob"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Товита|Товита|Тов(?:ит)?|Tob)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jdt"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Юдити|Юдити|Jdt)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Вар(?:уха)?|Bar)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sus"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Сус(?:анна)?|Sus)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	]
	# Short-circuit the look if we know we want all the books.
	return books if include_apocrypha is true and case_sensitive is "none"
	# Filter out books in the Apocrypha if we don't want them. `Array.map` isn't supported below IE9.
	out = []
	for book in books
		continue if include_apocrypha is false and book.apocrypha? and book.apocrypha is true
		if case_sensitive is "books"
			book.regexp = new RegExp book.regexp.source, "g"
		out.push book
	out

# Default to not using the Apocrypha
bcv_parser::regexps.books = bcv_parser::regexps.get_books false, "none"
